README.org
#+TITLE: P2X - Universal parser with XML output
#+author: Johannes Willkomm

* Introduction

P2X is a parser, configurable by shortcut grammars, with XML
output. The parser uses recursive descent parsing to read any kind of
text such as program code, configuration files or even natural
language. The input is structured as a tree according to grammar rules
which can be specified in a very concise and simple form. The XML
output is in a form that makes unparsing particularly simple. This
makes P2X suitable for the integration of non-XML data into XML-based
projects and/or for source transformation using XSLT.

Consider the following example, were we define solely the binary
operator PLUS and specify XML output in /merged mode/:
#+BEGIN_SRC sh :results output :exports both
echo -n "1+2+3" > in.txt
p2x -m -X -b PLUS -o out.xml in.txt
cat out.xml
#+END_SRC

#+RESULTS:
#+begin_example
<?xml version="1.0" encoding="utf-8"?>
<!-- P2X version 0.6.4 (72b96eb2) -->
<code-xml xmlns='http://johannes-willkomm.de/xml/code-xml/' xmlns:c='http://johannes-willkomm.de/xml/code-xml/attributes/' xmlns:ci='http://johannes-willkomm.de/xml/code-xml/ignore'>
 <ROOT>
  <null/>
  <PLUS>
   <INT><c:t>1</c:t></INT>
   <c:t>+</c:t>
   <INT><c:t>2</c:t></INT>
   <c:t>+</c:t>
   <INT><c:t>3</c:t></INT>
  </PLUS>
 </ROOT>
</code-xml>
#+end_example

One important property of the output is that all input token are
present, and that they are present strictly in the order of the
input. Thus the entire input text is present in the XML, structured by
XML tags. This is even true when some token are set to be ignored. The
ignored token are inserted into the tree by attaching them to the next
best tree node, but otherwise they have no effect on the shape of the
tree.

#+BEGIN_SRC sh :results output :exports both
echo -n "1 + 2 + 3" > in.txt
p2x -m -X -i SPACE -b PLUS -o out.xml in.txt
cat out.xml
#+END_SRC

#+RESULTS:
#+begin_example
<?xml version="1.0" encoding="utf-8"?>
<!-- P2X version 0.6.4 (72b96eb2) -->
<code-xml xmlns='http://johannes-willkomm.de/xml/code-xml/' xmlns:c='http://johannes-willkomm.de/xml/code-xml/attributes/' xmlns:ci='http://johannes-willkomm.de/xml/code-xml/ignore'>
 <ROOT>
  <null/>
  <PLUS>
   <INT>
    <c:t>1</c:t>
    <ci:SPACE> </ci:SPACE>
   </INT>
   <c:t>+</c:t>
   <ci:SPACE> </ci:SPACE>
   <INT>
    <c:t>2</c:t>
    <ci:SPACE> </ci:SPACE>
   </INT>
   <c:t>+</c:t>
   <ci:SPACE> </ci:SPACE>
   <INT><c:t>3</c:t></INT>
  </PLUS>
 </ROOT>
</code-xml>
#+end_example

Any token in the tree has exactly one special child element that
contains the input token text, in the example called ~c:t~. Ignored
token are output as elements with namespace prefix ~ci~, in the
example called ~ci:SPACE~.

Since the token text and ignored elements are in separate namespaces,
they do not affect the structure of the tree made up of the elements of
the code namespace. Still, the input can be recovered exactly by
concatenating the token text and ignored elements in document
order. This is done for example by the XSL stylesheet
file:src/xsl/reproduce.xsl:

#+BEGIN_SRC sh :results output :exports both
xsltproc src/xsl/reproduce.xsl out.xml
#+END_SRC

#+RESULTS:
: 1 + 2 + 3

The parsed tree structure can also be represented in MATLAB output:
#+BEGIN_SRC sh :results output :exports both
p2x -M -i SPACE -b PLUS in.txt
#+END_SRC

#+RESULTS:
: struct('n','rt','i','','c',{...
:  struct('n',{'','op'}, 't',{'','+'}, 'i',{'',' '}, 'c',{[],...
:   struct('n',{'op','num'}, 't',{'+','3'}, 'i',{' ',''}, 'c',{...
:    struct('n','num', 't',{'1','2'}, 'i',' '),[]})})});

or JSON:
#+BEGIN_SRC sh :results output :exports both
p2x -J -i SPACE -b PLUS in.txt
#+END_SRC

#+RESULTS:
: {"n":"rt","i":"","c":[
:  {"n":["","op"], "t":["","+"], "i":[""," "], "c":[{},
:   {"n":["op","num"], "t":["+","3"], "i":[" ",""], "c":[
:    {"n":"num", "t":["1","2"], "i":" "},{}]}]}]}

In both MATLAB and JSON format it is not possible to represent all
ignored items when using the merged output mode.

* Usage

P2X works as a stream filter, it reads from standard input and writes
to standard output. For example, to read input from file ~in.txt~
and write the XML file ~out.xml~, invoke P2X as follows
: p2x < in.txt > out.xml
P2X can also read from a file given as the first command line argument
: p2x in.txt > out.xml
or write its output to a file given by command line option =-o=
: p2x in.txt -o out.xml

There are currently four different output modes:

  - with option =-X= or =--xml= the tree is output in XML format
  - with option =-M= or =--matlab= the tree is output in MATLAB
    format, as a single large ~struct~ expression
  - with option =-J= or =--json= the tree is output in JSON format
  - the default is to output an older version of the XML format, which
    is more verbose

In XML the output tree is as described in this document. In MATLAB and
JSON each node has the three fields =n=, =t= and =c=, for the node
name, the node text and the node children, respectively.

** Program Configuration

P2X can be configured either by options on the command line or from a
configuration file, usually ~$HOME/.p2x/p2x-options~.

