README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-17 Sa 08:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>P2X - Universal parser with XML output</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johannes Willkomm" />
</head>
<body>
<div id="content">
<h1 class="title">P2X - Universal parser with XML output</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org857a8e3">1. Introduction</a></li>
<li><a href="#orgbcef281">2. Usage</a>
<ul>
<li><a href="#orgcbee83d">2.1. Program Configuration</a>
<ul>
<li><a href="#org81f2943">2.1.1. Options</a></li>
<li><a href="#org0ba39c3">2.1.2. Configuration file</a></li>
<li><a href="#org179157d">2.1.3. Environment variables</a></li>
</ul>
</li>
<li><a href="#org1c29d3c">2.2. Language definition</a>
<ul>
<li><a href="#orga4c1bce">2.2.1. Class Item</a></li>
<li><a href="#org6fd0700">2.2.2. Class Binary</a></li>
<li><a href="#orge4109eb">2.2.3. Class Unary</a></li>
<li><a href="#org928c239">2.2.4. Class Unary_Binary</a></li>
<li><a href="#orgee8b6eb">2.2.5. Class Postfix</a></li>
<li><a href="#org65ad086">2.2.6. Class Ignore</a></li>
<li><a href="#org85be915">2.2.7. Parentheses</a></li>
<li><a href="#org236d1fe">2.2.8. Line comments and block comments</a></li>
<li><a href="#org3de5ed1">2.2.9. Ignoring tokens depending on context</a></li>
<li><a href="#orgc963dc7">2.2.10. Example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5d25cd4">3. About this document</a></li>
</ul>
</div>
</div>

<div id="outline-container-org857a8e3" class="outline-2">
<h2 id="org857a8e3"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
P2X is a parser, configurable by shortcut grammars, with XML
output. The parser uses recursive descent parsing to read any kind of
text such as program code, configuration files or even natural
language. The input is structured as a tree according to grammar rules
which can be specified in a very concise and simple form. The XML
output is in a form that makes unparsing particularly simple. This
makes P2X suitable for the integration of non-XML data into XML-based
projects and/or for source transformation using XSLT.
</p>

<p>
Consider the following example, were we define solely the binary
operator PLUS and specify XML output in <i>merged mode</i>:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"1+2+3"</span> &gt; in.txt
p2x -m -X -b PLUS -o out.xml in.txt
cat out.xml
</pre>
</div>

<pre class="example">
&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;!-- P2X version 0.6.4 (72b96eb2) --&gt;
&lt;code-xml xmlns='http://johannes-willkomm.de/xml/code-xml/' xmlns:c='http://johannes-willkomm.de/xml/code-xml/attributes/' xmlns:ci='http://johannes-willkomm.de/xml/code-xml/ignore'&gt;
 &lt;ROOT&gt;
  &lt;null/&gt;
  &lt;PLUS&gt;
   &lt;INT&gt;&lt;c:t&gt;1&lt;/c:t&gt;&lt;/INT&gt;
   &lt;c:t&gt;+&lt;/c:t&gt;
   &lt;INT&gt;&lt;c:t&gt;2&lt;/c:t&gt;&lt;/INT&gt;
   &lt;c:t&gt;+&lt;/c:t&gt;
   &lt;INT&gt;&lt;c:t&gt;3&lt;/c:t&gt;&lt;/INT&gt;
  &lt;/PLUS&gt;
 &lt;/ROOT&gt;
&lt;/code-xml&gt;
</pre>

<p>
One important property of the output is that all input token are
present, and that they are present strictly in the order of the
input. Thus the entire input text is present in the XML, structured by
XML tags. This is even true when some token are set to be ignored. The
ignored token are inserted into the tree by attaching them to the next
best tree node, but otherwise they have no effect on the shape of the
tree.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"1 + 2 + 3"</span> &gt; in.txt
p2x -m -X -i SPACE -b PLUS -o out.xml in.txt
cat out.xml
</pre>
</div>

<pre class="example">
&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;!-- P2X version 0.6.4 (72b96eb2) --&gt;
&lt;code-xml xmlns='http://johannes-willkomm.de/xml/code-xml/' xmlns:c='http://johannes-willkomm.de/xml/code-xml/attributes/' xmlns:ci='http://johannes-willkomm.de/xml/code-xml/ignore'&gt;
 &lt;ROOT&gt;
  &lt;null/&gt;
  &lt;PLUS&gt;
   &lt;INT&gt;
    &lt;c:t&gt;1&lt;/c:t&gt;
    &lt;ci:SPACE&gt; &lt;/ci:SPACE&gt;
   &lt;/INT&gt;
   &lt;c:t&gt;+&lt;/c:t&gt;
   &lt;ci:SPACE&gt; &lt;/ci:SPACE&gt;
   &lt;INT&gt;
    &lt;c:t&gt;2&lt;/c:t&gt;
    &lt;ci:SPACE&gt; &lt;/ci:SPACE&gt;
   &lt;/INT&gt;
   &lt;c:t&gt;+&lt;/c:t&gt;
   &lt;ci:SPACE&gt; &lt;/ci:SPACE&gt;
   &lt;INT&gt;&lt;c:t&gt;3&lt;/c:t&gt;&lt;/INT&gt;
  &lt;/PLUS&gt;
 &lt;/ROOT&gt;
&lt;/code-xml&gt;
</pre>

<p>
Any token in the tree has exactly one special child element that
contains the input token text, in the example called <code>c:t</code>. Ignored
token are output as elements with namespace prefix <code>ci</code>, in the
example called <code>ci:SPACE</code>.
</p>

<p>
Since the token text and ignored elements are in separate namespaces,
they do not affect the structure of the tree made up of the elements of
the code namespace. Still, the input can be recovered exactly by
concatenating the token text and ignored elements in document
order. This is done for example by the XSL stylesheet
<a href="src/xsl/reproduce.xsl">src/xsl/reproduce.xsl</a>:
</p>

<div class="org-src-container">
<pre class="src src-sh">xsltproc src/xsl/reproduce.xsl out.xml
</pre>
</div>

<pre class="example">
1 + 2 + 3

</pre>

<p>
The parsed tree structure can also be represented in MATLAB output:
</p>
<div class="org-src-container">
<pre class="src src-sh">p2x -M -i SPACE -b PLUS in.txt
</pre>
</div>

<pre class="example">
struct('n','rt','i','','c',{...
 struct('n',{'','op'}, 't',{'','+'}, 'i',{'',' '}, 'c',{[],...
  struct('n',{'op','num'}, 't',{'+','3'}, 'i',{' ',''}, 'c',{...
   struct('n','num', 't',{'1','2'}, 'i',' '),[]})})});

</pre>

<p>
or JSON:
</p>
<div class="org-src-container">
<pre class="src src-sh">p2x -J -i SPACE -b PLUS in.txt
</pre>
</div>

<pre class="example">
{"n":"rt","i":"","c":[
 {"n":["","op"], "t":["","+"], "i":[""," "], "c":[{},
  {"n":["op","num"], "t":["+","3"], "i":[" ",""], "c":[
   {"n":"num", "t":["1","2"], "i":" "},{}]}]}]}

</pre>

<p>
In both MATLAB and JSON format it is not possible to represent all
ignored items when using the merged output mode.
</p>
</div>
</div>

<div id="outline-container-orgbcef281" class="outline-2">
<h2 id="orgbcef281"><span class="section-number-2">2</span> Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
P2X works as a stream filter, it reads from standard input and writes
to standard output. For example, to read input from file <code>in.txt</code>
and write the XML file <code>out.xml</code>, invoke P2X as follows
</p>
<pre class="example">
p2x &lt; in.txt &gt; out.xml

</pre>
<p>
P2X can also read from a file given as the first command line argument
</p>
<pre class="example">
p2x in.txt &gt; out.xml

</pre>
<p>
or write its output to a file given by command line option <code>-o</code>
</p>
<pre class="example">
p2x in.txt -o out.xml

</pre>

<p>
There are currently four different output modes:
</p>

<ul class="org-ul">
<li>with option <code>-X</code> or <code>--xml</code> the tree is output in XML format</li>
<li>with option <code>-M</code> or <code>--matlab</code> the tree is output in MATLAB
format, as a single large <code>struct</code> expression</li>
<li>with option <code>-J</code> or <code>--json</code> the tree is output in JSON format</li>
<li>the default is to output an older version of the XML format, which
is more verbose</li>
</ul>

<p>
In XML the output tree is as described in this document. In MATLAB and
JSON each node has the three fields <code>n</code>, <code>t</code> and <code>c</code>, for the node
name, the node text and the node children, respectively.
</p>
</div>

<div id="outline-container-orgcbee83d" class="outline-3">
<h3 id="orgcbee83d"><span class="section-number-3">2.1</span> Program Configuration</h3>
<div class="outline-text-3" id="text-2-1">
<p>
P2X can be configured either by options on the command line or from a
configuration file, usually <code>$HOME/.p2x/p2x-options</code>.
</p>
</div>
