README.org
*** Options
<<Options>>

Each option has a long name and some also have a short name. The most
important options are the following:

    - -o, --output :: specify name of output file
    - -p, --prec-list :: specify name of language definition file
    - -m, --merged :: set merged output mode
    - -X, -M, or -J :: set XML, MATLAB, or JSON output mode
    - -S :: specify scanner (lexer)
    - -g :: add debug information such as line numbers

The configuration options are listed in entirety in the following
table:

| Short | Long Option              | Description                                                                                 |
|-------+--------------------------+---------------------------------------------------------------------------------------------|
| -h    | --help                   | Print help and exit                                                                         |
|       | --full-help              | Print help, including hidden options, and exit                                              |
|       | --version                | Print version and exit                                                                      |
| -V    | --verbose=<number>       | Control messages by bit mask (default=`error,warning')                                      |
|       | --debug                  | Enable debugging  (default=off)                                                             |
| -p    | --prec-list=filename     | Precedence file list                                                                        |
| -i    | --ignore=TokenList       | Add an item to ignore                                                                       |
| -b    | --binary=TokenList       | Add a binary operator                                                                       |
| -r    | --right=TokenList        | Add a right associative operator                                                            |
| -u    | --unary=TokenList        | Add a unary operator                                                                        |
|       | --postfix=TokenList      | Add a postfix operator                                                                      |
| -I    | --item=TokenList         | Add an item                                                                                 |
| -B    | --brace=TokenPair        | Scope start and end token                                                                   |
| -L    | --list-token             | List token types  (default=off)                                                             |
| -T    | --list-classes           | List token classes  (default=off)                                                           |
| -s    | --scan-only              | Scan only, do not parse  (default=off)                                                      |
| -S    | --scanner=name           | Select scanner class  (default=`strings')                                                   |
| -e    | --input-encoding=Charset | Input encoding  (default=`utf-8')                                                           |
|       | --stdin-tty              | Read from stdin, even if it is a TTY (default=off)                                          |
|-------+--------------------------+---------------------------------------------------------------------------------------------|
| -o    | --outfile=Filename       | Write output to file ~Filename~                                                             |
|       | --indent                 | Indent  (default=on)                                                                        |
|       | --indent-unit=String     | Indentation unit  (default=` ')                                                             |
|       | --newline-as-br          | Emit newline text as ca:br element of ca:text (default=on)                                  |
|       | --newline-as-entity      | Emit newline text as &#xa; character entity (default=off)                                   |
| -m    | --merged                 | Merge same operator chains, tree will not be binary (default=off)                           |
| -n    | --noignore               | Skip ignored token  (default=off)                                                           |
| -l    | --loose                  | Write null elements more loosely (default=off)                                              |
|       | --strict                 | Write null elements more strictly (default=off)                                             |
| -O    | --output-mode=Mode       | Write output as normal (x) or alternative (y) XML, or (J)SON or (M)ATLAB code (default=`y') |
| -M    | --matlab                 | Write output as MATLAB  (default=off)                                                       |
| -J    | --json                   | Write output as JSON  (default=off)                                                         |
| -X    | --xml                    | Write output as XML  (default=off)                                                          |
|       | --write-recursive        | Recursive output writing  (default=off)                                                     |
| -g    | --src-info               | Emit source location attributes line, column, and character  (default=off)                  |
|       | --attribute-line         | Emit attribute line with source line (default=on)                                           |
|       | --attribute-column       | Emit attribute column with source column (default=on)                                       |
|       | --attribute-char         | Emit attribute column with source char (default=off)                                        |
|       | --attribute-precedence   | Emit attribute precedence with token precedence (default=off)                               |
|       | --attribute-mode         | Emit attribute mode with token mode (default=off)                                           |
|       | --attribute-type         | Emit attribute type with token type (default=on)                                            |
|       | --attribute-id           | Emit attribute id with token id  (default=off)                                              |


*** Configuration file

The same options (see previous Section [[Options]]) as on the command line
can also be given in a configuration file, which by default searched
as ~~/.p2x/p2x-options~. In that file there may be one option per
line, short or long, but without the leading ~-~ or ~--~. For example,
the following three lines all enable the verbosity level ~debug~:

#+BEGIN_EXAMPLE
V debug
verbose debug
verbose=debug
#+END_EXAMPLE

See also environment variable P2X_USER_DIR in Section [[Environment variables][Environment variables]].

