README.html

<div id="outline-container-org81f2943" class="outline-4">
<h4 id="org81f2943"><span class="section-number-4">2.1.1</span> Options</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<a id="orgcead448"></a>
</p>

<p>
Each option has a long name and some also have a short name. The most
important options are the following:
</p>

<dl class="org-dl">
<dt>-o, &#x2013;output</dt><dd>specify name of output file</dd>
<dt>-p, &#x2013;prec-list</dt><dd>specify name of language definition file</dd>
<dt>-m, &#x2013;merged</dt><dd>set merged output mode</dd>
<dt>-X, -M, or -J</dt><dd>set XML, MATLAB, or JSON output mode</dd>
<dt>-S</dt><dd>specify scanner (lexer)</dd>
<dt>-g</dt><dd>add debug information such as line numbers</dd>
</dl>

<p>
The configuration options are listed in entirety in the following
table:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Short</th>
<th scope="col" class="org-left">Long Option</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">-h</td>
<td class="org-left">&#x2013;help</td>
<td class="org-left">Print help and exit</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;full-help</td>
<td class="org-left">Print help, including hidden options, and exit</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;version</td>
<td class="org-left">Print version and exit</td>
</tr>

<tr>
<td class="org-left">-V</td>
<td class="org-left">&#x2013;verbose=&lt;number&gt;</td>
<td class="org-left">Control messages by bit mask (default=`error,warning')</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;debug</td>
<td class="org-left">Enable debugging  (default=off)</td>
</tr>

<tr>
<td class="org-left">-p</td>
<td class="org-left">&#x2013;prec-list=filename</td>
<td class="org-left">Precedence file list</td>
</tr>

<tr>
<td class="org-left">-i</td>
<td class="org-left">&#x2013;ignore=TokenList</td>
<td class="org-left">Add an item to ignore</td>
</tr>

<tr>
<td class="org-left">-b</td>
<td class="org-left">&#x2013;binary=TokenList</td>
<td class="org-left">Add a binary operator</td>
</tr>

<tr>
<td class="org-left">-r</td>
<td class="org-left">&#x2013;right=TokenList</td>
<td class="org-left">Add a right associative operator</td>
</tr>

<tr>
<td class="org-left">-u</td>
<td class="org-left">&#x2013;unary=TokenList</td>
<td class="org-left">Add a unary operator</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;postfix=TokenList</td>
<td class="org-left">Add a postfix operator</td>
</tr>

<tr>
<td class="org-left">-I</td>
<td class="org-left">&#x2013;item=TokenList</td>
<td class="org-left">Add an item</td>
</tr>

<tr>
<td class="org-left">-B</td>
<td class="org-left">&#x2013;brace=TokenPair</td>
<td class="org-left">Scope start and end token</td>
</tr>

<tr>
<td class="org-left">-L</td>
<td class="org-left">&#x2013;list-token</td>
<td class="org-left">List token types  (default=off)</td>
</tr>

<tr>
<td class="org-left">-T</td>
<td class="org-left">&#x2013;list-classes</td>
<td class="org-left">List token classes  (default=off)</td>
</tr>

<tr>
<td class="org-left">-s</td>
<td class="org-left">&#x2013;scan-only</td>
<td class="org-left">Scan only, do not parse  (default=off)</td>
</tr>

<tr>
<td class="org-left">-S</td>
<td class="org-left">&#x2013;scanner=name</td>
<td class="org-left">Select scanner class  (default=`strings')</td>
</tr>

<tr>
<td class="org-left">-e</td>
<td class="org-left">&#x2013;input-encoding=Charset</td>
<td class="org-left">Input encoding  (default=`utf-8')</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;stdin-tty</td>
<td class="org-left">Read from stdin, even if it is a TTY (default=off)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">-o</td>
<td class="org-left">&#x2013;outfile=Filename</td>
<td class="org-left">Write output to file <code>Filename</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;indent</td>
<td class="org-left">Indent  (default=on)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;indent-unit=String</td>
<td class="org-left">Indentation unit  (default=` ')</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;newline-as-br</td>
<td class="org-left">Emit newline text as ca:br element of ca:text (default=on)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;newline-as-entity</td>
<td class="org-left">Emit newline text as &amp;#xa; character entity (default=off)</td>
</tr>

<tr>
<td class="org-left">-m</td>
<td class="org-left">&#x2013;merged</td>
<td class="org-left">Merge same operator chains, tree will not be binary (default=off)</td>
</tr>

<tr>
<td class="org-left">-n</td>
<td class="org-left">&#x2013;noignore</td>
<td class="org-left">Skip ignored token  (default=off)</td>
</tr>

<tr>
<td class="org-left">-l</td>
<td class="org-left">&#x2013;loose</td>
<td class="org-left">Write null elements more loosely (default=off)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;strict</td>
<td class="org-left">Write null elements more strictly (default=off)</td>
</tr>

<tr>
<td class="org-left">-O</td>
<td class="org-left">&#x2013;output-mode=Mode</td>
<td class="org-left">Write output as normal (x) or alternative (y) XML, or (J)SON or (M)ATLAB code (default=`y')</td>
</tr>

<tr>
<td class="org-left">-M</td>
<td class="org-left">&#x2013;matlab</td>
<td class="org-left">Write output as MATLAB  (default=off)</td>
</tr>

<tr>
<td class="org-left">-J</td>
<td class="org-left">&#x2013;json</td>
<td class="org-left">Write output as JSON  (default=off)</td>
</tr>

<tr>
<td class="org-left">-X</td>
<td class="org-left">&#x2013;xml</td>
<td class="org-left">Write output as XML  (default=off)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;write-recursive</td>
<td class="org-left">Recursive output writing  (default=off)</td>
</tr>

<tr>
<td class="org-left">-g</td>
<td class="org-left">&#x2013;src-info</td>
<td class="org-left">Emit source location attributes line, column, and character  (default=off)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;attribute-line</td>
<td class="org-left">Emit attribute line with source line (default=on)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;attribute-column</td>
<td class="org-left">Emit attribute column with source column (default=on)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;attribute-char</td>
<td class="org-left">Emit attribute column with source char (default=off)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;attribute-precedence</td>
<td class="org-left">Emit attribute precedence with token precedence (default=off)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;attribute-mode</td>
<td class="org-left">Emit attribute mode with token mode (default=off)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;attribute-type</td>
<td class="org-left">Emit attribute type with token type (default=on)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2013;attribute-id</td>
<td class="org-left">Emit attribute id with token id  (default=off)</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org0ba39c3" class="outline-4">
<h4 id="org0ba39c3"><span class="section-number-4">2.1.2</span> Configuration file</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
The same options (see previous Section <a href="#orgcead448">2.1.1</a>) as on the command line
can also be given in a configuration file, which by default searched
as <code>~/.p2x/p2x-options</code>. In that file there may be one option per
line, short or long, but without the leading <code>-</code> or <code>--</code>. For example,
the following three lines all enable the verbosity level <code>debug</code>:
</p>

<pre class="example">
V debug
verbose debug
verbose=debug
</pre>

<p>
See also environment variable P2X_USER_DIR in Section <a href="#org7181b31">Environment variables</a>.
</p>
</div>
</div>
