README.org
*** Environment variables
<<Environment variables>>

    - HOME: Linux only: determine home directory of current user
    
    - HOMEDRIVE, HOMEPATH, APPDATA: Windows only: determine home
      directory of current user

    - P2X_USER_DIR: Set the directory where the
      configuration file ~p2x-options~ is found. Default is $HOME/.p2x

    - P2X_CONFIG_DIR: If set, this directory is also searched for
      language definition files

    - P2X_DEBUG_INIT: set to non-empty string to turn on debugging of
      the initialization of P2X



** Language definition

The equivalent of a grammar is called language definition in P2X. It
consists of an assignment of /token/ to /token classes/. Token are
those listed by the option =--list-token= or =-L=.

Which token are returned for a given character input depends on the
scanner selected with option =--scanner= or =-S=. Since the scanners
are defined with Flex there currently is only limited set of scanners
to chose from: =c=, =r=, =strings=, =no-strings=. For example, the
=no-strings= scanner reports each single quote ~'~ as a token APOS and
each double quote ~"~ character as a token QUOTE, and it will never
return a token STRING.

The available token classes are the following:

   - Item
   - Binary
   - Unary
   - Binary_unary
   - Postfix
   - Ignore
   - Line_comment
   - Block_comment

Identifiers play a special role, that is, while IDENTIFIER is listed
as one of the token types, each identifier such as ~x~, ~sin~ or
~times~ may individually be assigned to a token class. For example
~sin~ might be assigned to class Unary and ~times~ might be assigned
to class Binary. The set of legal identifiers also depends on the
selected scanner, but as of now all scanners have the same definition.

The basic definition of an identifier is based on the C
model. Identifiers may also contain any of the upper Unicode
characters. Currently the hyphen character may not occur in an
identifier, for example, "a-b" will be scanned as three tokens.

The token ROOT and JUXTA are special: ROOT is always in class Unary
with precedence 0 and JUXTA is always in class Binary, and the
precedence and associativity of this operator may be set by the
user. Both ROOT and JUXTA do not represent any input. The ROOT token
is always present as the root of the parse tree. The JUXTA token is
automatically inserted in the parse tree as a binary operator whenever
two consecutive items are encountered.

By default all other token are in class Item.

Also, a pair of token may be declared as /parentheses/. This pair of
token encapsulates some subexpression and will be inserted into the
parse tree as a whole. The content of a parentheses is itself a parse
tree.

A parentheses element can also be assigned to a token class. For
example, the parentheses ~(~ and ~)~ may be declared as a postfix
operator.

The effect of the configuration can be inspected by using the option
=-T=.
#+BEGIN_SRC sh
p2x -T -p examples/configs-special/cfuncs.p2c
#+END_SRC

Generally token can either by referred to by the name of the token
class as listed by the option =-L= or they can be referred to
literally, in quotes. For example, the following two lines are
equivalent:

#+BEGIN_SRC sh
MULT    binary 1002
"*"     binary 1002
#+END_SRC

Currently there is no way to see the regular expression used by the
scanner for each token type, and no way to see which set of input
words is represented by a given token. Also there is currently no
documentation telling you that the token returned by the scanner for
the input =*= is called MULT. Hence it is probably preferably to use
the second form. For individual identifiers the only option is of
course to use the quoted form.

Example configuration files can be found in the directory
~examples/configs~. The file [[./examples/configs/default]] is used by the
P2X test suite and showcases all available declarations and options.

*** Class Item

All token types, except JUXTA and ROOT, are by default in class
Item. Items are represented as tree nodes without children, also
called leafs. Two consecutive items are joined automatically by
artificial binary JUXTA nodes.

