README.html

<div id="outline-container-org179157d" class="outline-4">
<h4 id="org179157d"><span class="section-number-4">2.1.3</span> Environment variables</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<a id="org7181b31"></a>
</p>

<ul class="org-ul">
<li>HOME: Linux only: determine home directory of current user</li>

<li>HOMEDRIVE, HOMEPATH, APPDATA: Windows only: determine home
directory of current user</li>

<li>P2X_USER_DIR: Set the directory where the
configuration file <code>p2x-options</code> is found. Default is $HOME/.p2x</li>

<li>P2X_CONFIG_DIR: If set, this directory is also searched for
language definition files</li>

<li>P2X_DEBUG_INIT: set to non-empty string to turn on debugging of
the initialization of P2X</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org1c29d3c" class="outline-3">
<h3 id="org1c29d3c"><span class="section-number-3">2.2</span> Language definition</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The equivalent of a grammar is called language definition in P2X. It
consists of an assignment of <i>token</i> to <i>token classes</i>. Token are
those listed by the option <code>--list-token</code> or <code>-L</code>.
</p>

<p>
Which token are returned for a given character input depends on the
scanner selected with option <code>--scanner</code> or <code>-S</code>. Since the scanners
are defined with Flex there currently is only limited set of scanners
to chose from: <code>c</code>, <code>r</code>, <code>strings</code>, <code>no-strings</code>. For example, the
<code>no-strings</code> scanner reports each single quote <code>'</code> as a token APOS and
each double quote <code>"</code> character as a token QUOTE, and it will never
return a token STRING.
</p>

<p>
The available token classes are the following:
</p>

<ul class="org-ul">
<li>Item</li>
<li>Binary</li>
<li>Unary</li>
<li>Binary_unary</li>
<li>Postfix</li>
<li>Ignore</li>
<li>Line_comment</li>
<li>Block_comment</li>
</ul>

<p>
Identifiers play a special role, that is, while IDENTIFIER is listed
as one of the token types, each identifier such as <code>x</code>, <code>sin</code> or
<code>times</code> may individually be assigned to a token class. For example
<code>sin</code> might be assigned to class Unary and <code>times</code> might be assigned
to class Binary. The set of legal identifiers also depends on the
selected scanner, but as of now all scanners have the same definition.
</p>

<p>
The basic definition of an identifier is based on the C
model. Identifiers may also contain any of the upper Unicode
characters. Currently the hyphen character may not occur in an
identifier, for example, "a-b" will be scanned as three tokens.
</p>

<p>
The token ROOT and JUXTA are special: ROOT is always in class Unary
with precedence 0 and JUXTA is always in class Binary, and the
precedence and associativity of this operator may be set by the
user. Both ROOT and JUXTA do not represent any input. The ROOT token
is always present as the root of the parse tree. The JUXTA token is
automatically inserted in the parse tree as a binary operator whenever
two consecutive items are encountered.
</p>

<p>
By default all other token are in class Item.
</p>

<p>
Also, a pair of token may be declared as <i>parentheses</i>. This pair of
token encapsulates some subexpression and will be inserted into the
parse tree as a whole. The content of a parentheses is itself a parse
tree.
</p>

<p>
A parentheses element can also be assigned to a token class. For
example, the parentheses <code>(</code> and <code>)</code> may be declared as a postfix
operator.
</p>

<p>
The effect of the configuration can be inspected by using the option
<code>-T</code>.
</p>
<div class="org-src-container">
<pre class="src src-sh">p2x -T -p examples/configs-special/cfuncs.p2c
</pre>
</div>

<p>
Generally token can either by referred to by the name of the token
class as listed by the option <code>-L</code> or they can be referred to
literally, in quotes. For example, the following two lines are
equivalent:
</p>

<div class="org-src-container">
<pre class="src src-sh">MULT    binary 1002
<span style="font-style: italic;">"*"</span>     binary 1002
</pre>
</div>

<p>
Currently there is no way to see the regular expression used by the
scanner for each token type, and no way to see which set of input
words is represented by a given token. Also there is currently no
documentation telling you that the token returned by the scanner for
the input <code>*</code> is called MULT. Hence it is probably preferably to use
the second form. For individual identifiers the only option is of
course to use the quoted form.
</p>

<p>
Example configuration files can be found in the directory
<code>examples/configs</code>. The file <a href="./examples/configs/default">./examples/configs/default</a> is used by the
P2X test suite and showcases all available declarations and options.
</p>
</div>

<div id="outline-container-orga4c1bce" class="outline-4">
<h4 id="orga4c1bce"><span class="section-number-4">2.2.1</span> Class Item</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
All token types, except JUXTA and ROOT, are by default in class
Item. Items are represented as tree nodes without children, also
called leafs. Two consecutive items are joined automatically by
artificial binary JUXTA nodes.
</p>
</div>
</div>
