README.org
*** Class Binary

Token types in class Binary represent binary operators, which become
binary nodes in the tree, that is, they will usually have two
children. A Binary token type has the associated fields /associativiy/
and /precedence/.

The class Binary is typically used for mathematical binary operators
such as +, -, *, / etc. One might also declare identifiers such as
~and~ or ~or~ as Binary. Binary token play a crucial role in
structuring the tree. For example, to parse a text file into the
individual lines, put token NEWLINE in class Binary, presumably with a
rather low precedence.

A token from class Binary has a /precedence/, which is a positive
integer, to order the binding strength of two adjacent operators. The
typical case is plus + and multiply *, where * has the higher
precedence. This way a+b*c is the same as a+(b*c) and a*b+c is the
same as (a*b)+c.

A token from class Binary also has an /associativity/ which is either
/left/ or /right/ to order two adjacent operators of the same
precedence. Usually, arithmetic operators like + and * are
left-associative, which means that a*b*c is the same as (a*b)*c. An
example for a right-associative operator is the assignment = in C,
where x=y=z is the same as x=(y=z).

A token is added to class Binary by one of two ways: first, by using
the option ~-b~ or ~--binary~, where you can use token names or
identifiers. The token will be given increasing precedences in the
order they appear in the command line, from the left to the right,
beginning with 1000:
#+BEGIN_SRC sh :results output :export
p2x -b NEWLINE -b PLUS -bMULT,DIV -btimes,divide
#+END_SRC

#+RESULTS:
#+begin_example
<?xml version="1.0" encoding="utf-8"?>
<!-- P2X version 0.6.4 (72b96eb2) -->
<code-xml xmlns='http://johannes-willkomm.de/xml/code-xml/' xmlns:ca='http://johannes-willkomm.de/xml/code-xml/attributes/'>
 <ca:steps/>
 <ca:scanner type='STRINGS'/>
 <ca:tree-writer col='0' merged='0' encoding='utf-8' nullName='null' id='0' indent='1' line='0' mode='0' newlineAsBr='1' newlineAsEntity='0' prec='0' strict='0' loose='0' type='1'/>
 <ca:token-types>
  <ca:op code='47' type='PLUS' mode='BINARY' precedence='1001' associativity='LEFT'/>
  <ca:op code='49' type='MULT' mode='BINARY' precedence='1002' associativity='LEFT'/>
  <ca:op code='50' type='DIV' mode='BINARY' precedence='1003' associativity='LEFT'/>
  <ca:op code='68' type='NEWLINE' mode='BINARY' precedence='1000' associativity='LEFT'/>
  <ca:op code='71' type='JUXTA' mode='BINARY' precedence='900' associativity='LEFT'/>
  <ca:op code='200' repr='times' type='IDENTIFIER' mode='BINARY' precedence='1004' associativity='LEFT'/>
  <ca:op code='201' repr='divide' type='IDENTIFIER' mode='BINARY' precedence='1005' associativity='LEFT'/>
 </ca:token-types>
 <root code='27' type='ROOT'>
 </root>
</code-xml>
#+end_example

The other way is by a ~binary~ declaration in the laguage definition
file, which has the form ~token~ ~binary~ followed by one to four
further fields: two integer precedences, an associativity (~left~ or
~right~) and an output mode (~nested~ or ~merged~).
#+BEGIN_EXAMPLE
newline binary 1000 merged
"="     binary 1001 right nested
"*"     binary 1002 merged left
#+END_EXAMPLE

In the output tree the binary operators are represented as binary
nodes with two children, their left and right operands. This can lead
to deeply nested trees. To mitigate this P2X can also output the
binary nodes in /merged/ mode. Then $n$ consecutive operators made of
the same token are collapsed into a single node with $n+1$
children. The option =-m= or =--merged= activates the merged output
globally and the =merged= keyword in a language definition declaration
can activate merged mode for individual operators in class Binary.

*** Class Unary

Token types in class Unary represent unary prefix operators, which
become unary nodes in the tree, that is, they will at most have a
single child. The child will always be the right child, that is, the
left pointer is always null. A Unary token type has the associated
field /precedence/.

The class Unary is typically used for mathematical unary operators
such as +, -. One might also declare identifiers such as ~sin~ or
~cos~ as Unary. Another use might be for a line comment delimiter such
as ~#~.

A token is added to class Unary by one of two ways: first, by using
the option ~-u~ or ~--unary~, where you can use token names or
identifiers. The token will be given increasing precedences in the
order they appear in the command line, from the left to the right,
beginning with 2000:
#+BEGIN_SRC sh :results output
p2x  -u 'sin,cos'
#+END_SRC

The other way is by a ~unary~ declaration in the laguage definition
file, which has the form ~token~ ~unary~ followed by an integer
precedence field. The command line
settings above are equivalent to the following entries in the language
definition file:
#+BEGIN_EXAMPLE
"sin" unary 2000
"cos" unary 2001
#+END_EXAMPLE

In the output tree Unary operators are output as a node with a two
child nodes, as they can be seen as a binary operator with the left
operand missing. The missing left operand is marked with a special
~null~ element, so that the single operand is the second child
element.

*** Class Unary_Binary

Class Unary_Binary is for token which may either occur as unary
operators or as binary operators. A typical example are plus ~+~ and
minus ~-~ in mathematical notation. For that, token may be assigned to
class Unary_Binary, which accepts two integer options, the first of
which is the binary precedence and the second the unary precedence. An
associativity may also be specified. For example, the following
configuration
#+BEGIN_EXAMPLE
"-" unary_binary 1000 2200 left
#+END_EXAMPLE

The same input ~-3~ can now result in either a unary node or a binary
node in the output tree, depending on the preceding token. When an
Item is pending because the preceding token was of class Unary or
Binary the minus ~-~ will result in a unary operator node, otherwise
as a binary node.

*** Class Postfix

The class Postfix is complementary of the Unary class. It defines a
unary postfix operator. Typical examples are the operators ~'~ and
~.'~ in MATLAB. Another example would be to define units as postfix
operators:

#+BEGIN_EXAMPLE
"kg" postfix 10000
"m" postfix 10000
"s" postfix 10000
#+END_EXAMPLE

Another important application are the typical function call and array
access expressions in may languages, such as ~f(x)~ or ~x[2]~. These
are most conveniently treated as postfix operators, which is possible
with P2X because each pair of parentheses can also be given a token
class, see section [[Parentheses]].

#+BEGIN_EXAMPLE
"(" PAREN ")" postfix 10000
"[" PAREN "]"  postfix 10000
#+END_EXAMPLE

In the output tree Postfix operators are output as a node with a
single child, as they can be seen as a binary operator with the right
operand missing.

