README.html

<div id="outline-container-org6fd0700" class="outline-4">
<h4 id="org6fd0700"><span class="section-number-4">2.2.2</span> Class Binary</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Token types in class Binary represent binary operators, which become
binary nodes in the tree, that is, they will usually have two
children. A Binary token type has the associated fields <i>associativiy</i>
and <i>precedence</i>.
</p>

<p>
The class Binary is typically used for mathematical binary operators
such as +, -, *, / etc. One might also declare identifiers such as
<code>and</code> or <code>or</code> as Binary. Binary token play a crucial role in
structuring the tree. For example, to parse a text file into the
individual lines, put token NEWLINE in class Binary, presumably with a
rather low precedence.
</p>

<p>
A token from class Binary has a <i>precedence</i>, which is a positive
integer, to order the binding strength of two adjacent operators. The
typical case is plus + and multiply *, where * has the higher
precedence. This way a+b*c is the same as a+(b*c) and a*b+c is the
same as (a*b)+c.
</p>

<p>
A token from class Binary also has an <i>associativity</i> which is either
<i>left</i> or <i>right</i> to order two adjacent operators of the same
precedence. Usually, arithmetic operators like + and * are
left-associative, which means that a*b*c is the same as (a*b)*c. An
example for a right-associative operator is the assignment = in C,
where x=y=z is the same as x=(y=z).
</p>

<p>
A token is added to class Binary by one of two ways: first, by using
the option <code>-b</code> or <code>--binary</code>, where you can use token names or
identifiers. The token will be given increasing precedences in the
order they appear in the command line, from the left to the right,
beginning with 1000:
</p>
<div class="org-src-container">
<pre class="src src-sh">p2x -b NEWLINE -b PLUS -bMULT,DIV -btimes,divide
</pre>
</div>

<p>
The other way is by a <code>binary</code> declaration in the laguage definition
file, which has the form <code>token</code> <code>binary</code> followed by one to four
further fields: two integer precedences, an associativity (<code>left</code> or
<code>right</code>) and an output mode (<code>nested</code> or <code>merged</code>).
</p>
<pre class="example">
newline binary 1000 merged
"="     binary 1001 right nested
"*"     binary 1002 merged left
</pre>

<p>
In the output tree the binary operators are represented as binary
nodes with two children, their left and right operands. This can lead
to deeply nested trees. To mitigate this P2X can also output the
binary nodes in <i>merged</i> mode. Then \(n\) consecutive operators made of
the same token are collapsed into a single node with \(n+1\)
children. The option <code>-m</code> or <code>--merged</code> activates the merged output
globally and the <code>merged</code> keyword in a language definition declaration
can activate merged mode for individual operators in class Binary.
</p>
</div>
</div>

<div id="outline-container-orge4109eb" class="outline-4">
<h4 id="orge4109eb"><span class="section-number-4">2.2.3</span> Class Unary</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Token types in class Unary represent unary prefix operators, which
become unary nodes in the tree, that is, they will at most have a
single child. The child will always be the right child, that is, the
left pointer is always null. A Unary token type has the associated
field <i>precedence</i>.
</p>

<p>
The class Unary is typically used for mathematical unary operators
such as +, -. One might also declare identifiers such as <code>sin</code> or
<code>cos</code> as Unary. Another use might be for a line comment delimiter such
as <code>#</code>.
</p>

<p>
A token is added to class Unary by one of two ways: first, by using
the option <code>-u</code> or <code>--unary</code>, where you can use token names or
identifiers. The token will be given increasing precedences in the
order they appear in the command line, from the left to the right,
beginning with 2000:
</p>
<div class="org-src-container">
<pre class="src src-sh">p2x  -u <span style="font-style: italic;">'sin,cos'</span>
</pre>
</div>

<p>
The other way is by a <code>unary</code> declaration in the laguage definition
file, which has the form <code>token</code> <code>unary</code> followed by an integer
precedence field. The command line
settings above are equivalent to the following entries in the language
definition file:
</p>
<pre class="example">
"sin" unary 2000
"cos" unary 2001
</pre>

<p>
In the output tree Unary operators are output as a node with a two
child nodes, as they can be seen as a binary operator with the left
operand missing. The missing left operand is marked with a special
<code>null</code> element, so that the single operand is the second child
element.
</p>
</div>
</div>

<div id="outline-container-org928c239" class="outline-4">
<h4 id="org928c239"><span class="section-number-4">2.2.4</span> Class Unary_Binary</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Class Unary_Binary is for token which may either occur as unary
operators or as binary operators. A typical example are plus <code>+</code> and
minus <code>-</code> in mathematical notation. For that, token may be assigned to
class Unary_Binary, which accepts two integer options, the first of
which is the binary precedence and the second the unary precedence. An
associativity may also be specified. For example, the following
configuration
</p>
<pre class="example">
"-" unary_binary 1000 2200 left
</pre>

<p>
The same input <code>-3</code> can now result in either a unary node or a binary
node in the output tree, depending on the preceding token. When an
Item is pending because the preceding token was of class Unary or
Binary the minus <code>-</code> will result in a unary operator node, otherwise
as a binary node.
</p>
</div>
</div>

<div id="outline-container-orgee8b6eb" class="outline-4">
<h4 id="orgee8b6eb"><span class="section-number-4">2.2.5</span> Class Postfix</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
The class Postfix is complementary of the Unary class. It defines a
unary postfix operator. Typical examples are the operators <code>'</code> and
<code>.'</code> in MATLAB. Another example would be to define units as postfix
operators:
</p>

<pre class="example">
"kg" postfix 10000
"m" postfix 10000
"s" postfix 10000
</pre>

<p>
Another important application are the typical function call and array
access expressions in may languages, such as <code>f(x)</code> or <code>x[2]</code>. These
are most conveniently treated as postfix operators, which is possible
with P2X because each pair of parentheses can also be given a token
class, see section <a href="#org34e4aaa">2.2.7</a>.
</p>

<pre class="example">
"(" PAREN ")" postfix 10000
"[" PAREN "]"  postfix 10000
</pre>

<p>
In the output tree Postfix operators are output as a node with a
single child, as they can be seen as a binary operator with the right
operand missing.
</p>
</div>
</div>
