README.org
*** Class Ignore

A token in class Ignore is not used in the construction of the parse
tree. However it is not simply discarded. Instead, it is inserted into
the tree at the next best convenient location. Thus the text that
constituted it is not lost but may be found in the tree as a sort of
side information.

In the language definition file, a token is assigned to class Ignore
with the keyword =ignore=, but a precedence is also required (it is
ignored):
#+BEGIN_EXAMPLE
NEWLINE ignore 1
#+end_example

In the XML output token in class Ignore are represented using a
separate namespace, so for many intents and purposes they are as good
as invisible. However, for input reconstruction it is of course
crucial that they are kept.

Keeping the Ignore token one can reconstruct input identically even if
its structure is unknown. P2X guarantees that all input characters,
including those from token in class Ignore also occur in the output
XML document, in the same order as they occured in the input.

In the MATLAB and JSON output formats it is not possible to represent
the token in class Ignore, so they are truly ignored and discared
then.

*** Parentheses
<<Parentheses>>

A pair of token which is declared as Parentheses encapsulates a
subexpression, such that on the outside it appears as a single item,
and in fact it is handled by default in the same way as a token from
class Item. A Parenthesis definition has a /closing list/, which is a
list of token that may close the subexpression. For example, one could
declare the left parenthesis token ~(~ and the right parenthesis ~)~
as being a Parenthesis. For each opening token, the Parenthesis
declarations are merged together, merging the closing lists. For
example, one might declare ~while~ and ~end~ and ~while~ and
~endwhile~ as Parentheses, then there will be internally just one
Parenthesis definition for ~while~ with the closing list set to the
tupel (~end~, ~endwhile~). 

A token may be added to class Parentheses using the command line
option ~-B~ or ~--brace~, which requires as an argument a pair of
token separated by ~,~ or ~:~., for example like this:
#+BEGIN_EXAMPLE
p2x -B '(:)' -B 'while:end' -B 'while:endwhile' -
#+END_EXAMPLE
or using a ~paren~ declaration in the language definition file:
#+BEGIN_EXAMPLE
"(" paren ")"
"while" paren "end"
"while" paren "endwhile"
#+END_EXAMPLE

A parenthesis expression is be default handled as being in token class
Item. However, parentheses declarations may also be assigned to any
other token class. This can be done for each parentheses declaration
individually. For example, the parentheses ~(~ and ~)~ may be declared
as being a postfix operator, to represent the typical function call
expression like ~f(x)~. This is done by adding the class keyword on
the line together with an integer specifying the precedence:
#+BEGIN_EXAMPLE
"(" paren ")" postfix 10000
#+END_EXAMPLE

Another way to parse a function call expression is to leave the
parentheses definition in token class Item and rely on the JUXTA
operator which will be inserted between the function name -- provided
that is parsed as an Item -- and the parentheses. One will probably
give a rather high precedence to the JUXTA operator then.

#+BEGIN_EXAMPLE
"(" paren ")"
JUXTA binary 2000
#+END_EXAMPLE

*** Line comments and block comments

Line comments and block comments can be used to escape from the normal
parsing parse comment text sections. Line comments start with a
certain token and continue until the next NEWLINE token. Block
comments work like parentheses and have start and end tokens.

All the text belonging to a comment is collected and inserted as a
single Ignore item into the parse tree. In the case of the line
comment the terminating NEWLINE is inserted individually, according to
the rules defined for it.

For example, the two modes of comments used in the C++ language can
be configured in P2X as follows:

#+BEGIN_EXAMPLE
"//" line_comment 1
"/*" block_comment "*/"
#+END_EXAMPLE

*** Ignoring tokens depending on context

There are two special rules that can override the normally configured
mode for certain token classes depending on the context. The first is
the flag ~ignoreIfStray~ that can be used with Binary token. The
effect is that a token from that class is treated as an Ignore token
when there is an open operator (Unary or Binary) in the tree already.

The other special rule is ~A ignoreAfter B~, which means that a token A is
treated as Ignore whenever it occurs after a B token.

For example, a special token to escape a NEWLINE, as in MATLAB, can be
configured in P2X as follows:

#+BEGIN_EXAMPLE
NEWLINE    BINARY 1000
"..."      IGNORE 1
NEWLINE    ignoreAfter "..."
#+END_EXAMPLE

