README.html

<div id="outline-container-org65ad086" class="outline-4">
<h4 id="org65ad086"><span class="section-number-4">2.2.6</span> Class Ignore</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
A token in class Ignore is not used in the construction of the parse
tree. However it is not simply discarded. Instead, it is inserted into
the tree at the next best convenient location. Thus the text that
constituted it is not lost but may be found in the tree as a sort of
side information.
</p>

<p>
In the language definition file, a token is assigned to class Ignore
with the keyword <code>ignore</code>, but a precedence is also required (it is
ignored):
</p>
<pre class="example">
NEWLINE ignore 1
</pre>

<p>
In the XML output token in class Ignore are represented using a
separate namespace, so for many intents and purposes they are as good
as invisible. However, for input reconstruction it is of course
crucial that they are kept.
</p>

<p>
Keeping the Ignore token one can reconstruct input identically even if
its structure is unknown. P2X guarantees that all input characters,
including those from token in class Ignore also occur in the output
XML document, in the same order as they occured in the input.
</p>

<p>
In the MATLAB and JSON output formats it is not possible to represent
the token in class Ignore, so they are truly ignored and discared
then.
</p>
</div>
</div>

<div id="outline-container-org85be915" class="outline-4">
<h4 id="org85be915"><span class="section-number-4">2.2.7</span> Parentheses</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
<a id="org34e4aaa"></a>
</p>

<p>
A pair of token which is declared as Parentheses encapsulates a
subexpression, such that on the outside it appears as a single item,
and in fact it is handled by default in the same way as a token from
class Item. A Parenthesis definition has a <i>closing list</i>, which is a
list of token that may close the subexpression. For example, one could
declare the left parenthesis token <code>(</code> and the right parenthesis <code>)</code>
as being a Parenthesis. For each opening token, the Parenthesis
declarations are merged together, merging the closing lists. For
example, one might declare <code>while</code> and <code>end</code> and <code>while</code> and
<code>endwhile</code> as Parentheses, then there will be internally just one
Parenthesis definition for <code>while</code> with the closing list set to the
tupel (<code>end</code>, <code>endwhile</code>). 
</p>

<p>
A token may be added to class Parentheses using the command line
option <code>-B</code> or <code>--brace</code>, which requires as an argument a pair of
token separated by <code>,</code> or <code>:</code>., for example like this:
</p>
<pre class="example">
p2x -B '(:)' -B 'while:end' -B 'while:endwhile' -
</pre>
<p>
or using a <code>paren</code> declaration in the language definition file:
</p>
<pre class="example">
"(" paren ")"
"while" paren "end"
"while" paren "endwhile"
</pre>

<p>
A parenthesis expression is be default handled as being in token class
Item. However, parentheses declarations may also be assigned to any
other token class. This can be done for each parentheses declaration
individually. For example, the parentheses <code>(</code> and <code>)</code> may be declared
as being a postfix operator, to represent the typical function call
expression like <code>f(x)</code>. This is done by adding the class keyword on
the line together with an integer specifying the precedence:
</p>
<pre class="example">
"(" paren ")" postfix 10000
</pre>

<p>
Another way to parse a function call expression is to leave the
parentheses definition in token class Item and rely on the JUXTA
operator which will be inserted between the function name &#x2013; provided
that is parsed as an Item &#x2013; and the parentheses. One will probably
give a rather high precedence to the JUXTA operator then.
</p>

<pre class="example">
"(" paren ")"
JUXTA binary 2000
</pre>
</div>
</div>

<div id="outline-container-org236d1fe" class="outline-4">
<h4 id="org236d1fe"><span class="section-number-4">2.2.8</span> Line comments and block comments</h4>
<div class="outline-text-4" id="text-2-2-8">
<p>
Line comments and block comments can be used to escape from the normal
parsing parse comment text sections. Line comments start with a
certain token and continue until the next NEWLINE token. Block
comments work like parentheses and have start and end tokens.
</p>

<p>
All the text belonging to a comment is collected and inserted as a
single Ignore item into the parse tree. In the case of the line
comment the terminating NEWLINE is inserted individually, according to
the rules defined for it.
</p>

<p>
For example, the two modes of comments used in the C++ language can
be configured in P2X as follows:
</p>

<pre class="example">
"//" line_comment 1
"/*" block_comment "*/"
</pre>
</div>
</div>

<div id="outline-container-org3de5ed1" class="outline-4">
<h4 id="org3de5ed1"><span class="section-number-4">2.2.9</span> Ignoring tokens depending on context</h4>
<div class="outline-text-4" id="text-2-2-9">
<p>
There are two special rules that can override the normally configured
mode for certain token classes depending on the context. The first is
the flag <code>ignoreIfStray</code> that can be used with Binary token. The
effect is that a token from that class is treated as an Ignore token
when there is an open operator (Unary or Binary) in the tree already.
</p>

<p>
The other special rule is <code>A ignoreAfter B</code>, which means that a token A is
treated as Ignore whenever it occurs after a B token.
</p>

<p>
For example, a special token to escape a NEWLINE, as in MATLAB, can be
configured in P2X as follows:
</p>

<pre class="example">
NEWLINE    BINARY 1000
"..."      IGNORE 1
NEWLINE    ignoreAfter "..."
</pre>
</div>
</div>
