README.org
*** Example

As an example consider the configuration file
[[file:examples/configs-special/cfuncs.p2c]] and the input text file
[[file:examples/in/cexpr.exp]]:
#+BEGIN_SRC sh :results output :exports both
cat examples/configs-special/cfuncs.p2c
#+END_SRC

#+RESULTS:
#+begin_example
#
# Operator definitions
#
# Token  Class         Precedence  Unary Prec.  Associativity  Options
","      binary        3                                       merged
";"      binary        3                                       merged
"return" unary         4
JUXTA    binary        5
"="      binary        6                        right
"=="     binary        7

"+"      unary_binary  10          110
"-"      unary_binary  10          110

"*"      unary_binary  20          120

"/"      binary        30
"%"      binary        30

"if"     unary        100
"while"  unary        100

#
# Parentheses definitions
#
# Start  "paren" End  Class    Precedence  Unary Prec.  Associativity
"("      paren   ")"  postfix  101
"["      paren   "]"  postfix  102
"{"      paren   "}"

" "      ignore        1
NEWLINE  ignore        1
TAB      ignore        1
#+end_example

#+BEGIN_SRC sh :results output :exports both
cat examples/in/cexpr.exp
#+END_SRC

#+RESULTS:
: f( a +	1)*2

#+BEGIN_SRC sh :results output :exports both
p2x -S c -lnX -p examples/configs-special/cfuncs.p2c examples/in/cexpr.exp
#+END_SRC

#+RESULTS:
#+begin_example
<?xml version="1.0" encoding="utf-8"?>
<!-- P2X version 0.6.4 (72b96eb2) -->
<code-xml xmlns='http://johannes-willkomm.de/xml/code-xml/' xmlns:c='http://johannes-willkomm.de/xml/code-xml/attributes/' xmlns:ci='http://johannes-willkomm.de/xml/code-xml/ignore'>
 <ROOT>
  <MULT>
   <L_PAREN>
    <ID><c:t>f</c:t></ID>
    <c:t>(</c:t>
    <R_PAREN>
     <PLUS>
      <ID><c:t>a</c:t></ID>
      <c:t>+</c:t>
      <INT><c:t>1</c:t></INT>
     </PLUS>
     <c:t>)</c:t>
    </R_PAREN>
   </L_PAREN>
   <c:t>*</c:t>
   <INT><c:t>2</c:t></INT>
  </MULT>
 </ROOT>
</code-xml>
#+end_example

As a more complex example try parsing an entire program:

#+BEGIN_SRC sh :results output :exports code
p2x -lnX -S c -p examples/configs-special/cfuncs.p2c examples/in/cfunc.exp
#+END_SRC

#+RESULTS:
#+begin_example
<?xml version="1.0" encoding="utf-8"?>
<!-- P2X version 0.6.4 (72b96eb2) -->
<code-xml xmlns='http://johannes-willkomm.de/xml/code-xml/' xmlns:c='http://johannes-willkomm.de/xml/code-xml/attributes/' xmlns:ci='http://johannes-willkomm.de/xml/code-xml/ignore'>
 <ROOT>
  <JUXTA>
   <JUXTA>
    <ID><c:t>int</c:t></ID>
    <L_PAREN>
     <ID><c:t>main</c:t></ID>
     <c:t>(</c:t>
     <R_PAREN>
      <COMMA>
       <JUXTA>
        <ID><c:t>int</c:t></ID>
        <ID><c:t>argc</c:t></ID>
       </JUXTA>
       <c:t>,</c:t>
       <MULT>
        <ID><c:t>char</c:t></ID>
        <c:t>*</c:t>
        <MULT>
         <c:t>*</c:t>
         <ID><c:t>argv</c:t></ID>
        </MULT>
       </MULT>
      </COMMA>
      <c:t>)</c:t>
     </R_PAREN>
    </L_PAREN>
   </JUXTA>
   <L_BRACE>
    <c:t>{</c:t>
    <R_BRACE>
     <SEMICOLON>
      <JUXTA>
       <if>
        <c:t>if</c:t>
        <L_PAREN>
         <c:t>(</c:t>
         <R_PAREN>
          <JUXTA>
           <JUXTA>
            <ID><c:t>argc</c:t></ID>
            <GREATER><c:t>&gt;</c:t></GREATER>
           </JUXTA>
           <INT><c:t>1</c:t></INT>
          </JUXTA>
          <c:t>)</c:t>
         </R_PAREN>
        </L_PAREN>
       </if>
       <L_PAREN>
        <ID><c:t>printf</c:t></ID>
        <c:t>(</c:t>
        <R_PAREN>
         <COMMA>
          <STRING><c:t>"Hello %s"</c:t></STRING>
          <c:t>,</c:t>
          <L_BRACKET>
           <ID><c:t>argv</c:t></ID>
           <c:t>[</c:t>
           <R_BRACKET>
            <INT><c:t>1</c:t></INT>
            <c:t>]</c:t>
           </R_BRACKET>
          </L_BRACKET>
         </COMMA>
         <c:t>)</c:t>
        </R_PAREN>
       </L_PAREN>
      </JUXTA>
      <c:t>;</c:t>
      <return>
       <c:t>return</c:t>
       <INT><c:t>0</c:t></INT>
      </return>
      <c:t>;</c:t>
     </SEMICOLON>
     <c:t>}</c:t>
    </R_BRACE>
   </L_BRACE>
  </JUXTA>
 </ROOT>
</code-xml>
#+end_example

* About this document

This file is part of P2X. See the file p2x.cc for copying conditions.  

Copyright © 2014,2016,2018 Johannes Willkomm

* Internal                                                         :noexport:

#+options: ^:{} H:4
