README.html

<div id="outline-container-orgc963dc7" class="outline-4">
<h4 id="orgc963dc7"><span class="section-number-4">2.2.10</span> Example</h4>
<div class="outline-text-4" id="text-2-2-10">
<p>
As an example consider the configuration file
<a href="examples/configs-special/cfuncs.p2c">examples/configs-special/cfuncs.p2c</a> and the input text file
<a href="examples/in/cexpr.exp">examples/in/cexpr.exp</a>:
</p>
<div class="org-src-container">
<pre class="src src-sh">cat examples/configs-special/cfuncs.p2c
</pre>
</div>

<pre class="example">
#
# Operator definitions
#
# Token  Class         Precedence  Unary Prec.  Associativity  Options
","      binary        3                                       merged
";"      binary        3                                       merged
"return" unary         4
JUXTA    binary        5
"="      binary        6                        right
"=="     binary        7

"+"      unary_binary  10          110
"-"      unary_binary  10          110

"*"      unary_binary  20          120

"/"      binary        30
"%"      binary        30

"if"     unary        100
"while"  unary        100

#
# Parentheses definitions
#
# Start  "paren" End  Class    Precedence  Unary Prec.  Associativity
"("      paren   ")"  postfix  101
"["      paren   "]"  postfix  102
"{"      paren   "}"

" "      ignore        1
NEWLINE  ignore        1
TAB      ignore        1
</pre>

<div class="org-src-container">
<pre class="src src-sh">cat examples/in/cexpr.exp
</pre>
</div>

<pre class="example">
f( a +	1)*2

</pre>

<div class="org-src-container">
<pre class="src src-sh">p2x -S c -lnX -p examples/configs-special/cfuncs.p2c examples/in/cexpr.exp
</pre>
</div>

<pre class="example">
&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;!-- P2X version 0.6.4 (72b96eb2) --&gt;
&lt;code-xml xmlns='http://johannes-willkomm.de/xml/code-xml/' xmlns:c='http://johannes-willkomm.de/xml/code-xml/attributes/' xmlns:ci='http://johannes-willkomm.de/xml/code-xml/ignore'&gt;
 &lt;ROOT&gt;
  &lt;MULT&gt;
   &lt;L_PAREN&gt;
    &lt;ID&gt;&lt;c:t&gt;f&lt;/c:t&gt;&lt;/ID&gt;
    &lt;c:t&gt;(&lt;/c:t&gt;
    &lt;R_PAREN&gt;
     &lt;PLUS&gt;
      &lt;ID&gt;&lt;c:t&gt;a&lt;/c:t&gt;&lt;/ID&gt;
      &lt;c:t&gt;+&lt;/c:t&gt;
      &lt;INT&gt;&lt;c:t&gt;1&lt;/c:t&gt;&lt;/INT&gt;
     &lt;/PLUS&gt;
     &lt;c:t&gt;)&lt;/c:t&gt;
    &lt;/R_PAREN&gt;
   &lt;/L_PAREN&gt;
   &lt;c:t&gt;*&lt;/c:t&gt;
   &lt;INT&gt;&lt;c:t&gt;2&lt;/c:t&gt;&lt;/INT&gt;
  &lt;/MULT&gt;
 &lt;/ROOT&gt;
&lt;/code-xml&gt;
</pre>

<p>
As a more complex example try parsing an entire program:
</p>

<div class="org-src-container">
<pre class="src src-sh">p2x -lnX -S c -p examples/configs-special/cfuncs.p2c examples/in/cfunc.exp
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org5d25cd4" class="outline-2">
<h2 id="org5d25cd4"><span class="section-number-2">3</span> About this document</h2>
<div class="outline-text-2" id="text-3">
<p>
This file is part of P2X. See the file p2x.cc for copying conditions.  
</p>

<p>
Copyright © 2014,2016,2018 Johannes Willkomm
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Johannes Willkomm</p>
<p class="date">Created: 2018-11-17 Sa 08:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
